; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 13670)
	(= (fuel plane1) 3525)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 2999)
	(= (fuel plane2) 324)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city3)
	(= (capacity plane3) 2351)
	(= (fuel plane3) 547)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(at plane4 city4)
	(= (capacity plane4) 8892)
	(= (fuel plane4) 2949)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city5)
	(= (capacity plane5) 10932)
	(= (fuel plane5) 988)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 12)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city0)
	(at person2 city2)
	(at person3 city0)
	(at person4 city5)
	(at person5 city1)
	(at person6 city2)
	(at person7 city4)
	(at person8 city5)
	(at person9 city0)
	(at person10 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 880)
	(= (distance city0 city2) 524)
	(= (distance city0 city3) 957)
	(= (distance city0 city4) 902)
	(= (distance city0 city5) 556)
	(= (distance city1 city0) 880)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 868)
	(= (distance city1 city3) 943)
	(= (distance city1 city4) 510)
	(= (distance city1 city5) 525)
	(= (distance city2 city0) 524)
	(= (distance city2 city1) 868)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 894)
	(= (distance city2 city4) 726)
	(= (distance city2 city5) 611)
	(= (distance city3 city0) 957)
	(= (distance city3 city1) 943)
	(= (distance city3 city2) 894)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 716)
	(= (distance city3 city5) 802)
	(= (distance city4 city0) 902)
	(= (distance city4 city1) 510)
	(= (distance city4 city2) 726)
	(= (distance city4 city3) 716)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 765)
	(= (distance city5 city0) 556)
	(= (distance city5 city1) 525)
	(= (distance city5 city2) 611)
	(= (distance city5 city3) 802)
	(= (distance city5 city4) 765)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at plane2 city2)
	(at plane3 city0)
	(at person1 city2)
	(at person2 city1)
	(at person3 city5)
	(at person4 city0)
	(at person5 city5)
	(at person6 city0)
	(at person8 city2)
	(at person9 city3)
	(at person10 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (fly plane4 city4 city2)
   deleted: (at plane4 city4)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 0 to 2178, (fuel plane4) from 2949 to 771
   goals met: 0 of 12
2. (board person4 plane1 city5)
   deleted: (at person4 city5)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 12
3. (refuel plane3 city3)
   changed: (fuel plane3) from 547 to 2351
   goals met: 0 of 12
4. (board person8 plane1 city5)
   deleted: (at person8 city5)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 12
5. (zoom plane3 city3 city0)
   deleted: (at plane3 city3)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 2178 to 4092, (fuel plane3) from 2351 to 437
   goals met: 1 of 12
6. (refuel plane1 city5)
   changed: (fuel plane1) from 3525 to 13670
   goals met: 1 of 12
7. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4092 to 6872, (fuel plane1) from 13670 to 10890
   goals met: 1 of 12
8. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 12
9. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 12
10. (board person9 plane1 city0)
   deleted: (at person9 city0)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 2 of 12
11. (refuel plane2 city0)
   changed: (fuel plane2) from 324 to 2999
   goals met: 2 of 12
12. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 6872 to 11382, (fuel plane1) from 10890 to 6380
   goals met: 3 of 12
13. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 12
14. (zoom plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 11382 to 12430, (fuel plane2) from 2999 to 1951
   goals met: 4 of 12
15. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 12
16. (fly plane2 city2 city5)
   deleted: (at plane2 city2)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 12430 to 13041, (fuel plane2) from 1951 to 1340
   goals met: 3 of 12
17. (debark person3 plane2 city5)
   deleted: (in person3 plane2)
   added: (at person3 city5)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 12
18. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13041 to 16671, (fuel plane1) from 6380 to 2750
   goals met: 3 of 12
19. (refuel plane1 city2)
   changed: (fuel plane1) from 2750 to 13670
   goals met: 3 of 12
20. (fly plane2 city5 city2)
   deleted: (at plane2 city5)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 16671 to 17282, (fuel plane2) from 1340 to 729
   goals met: 4 of 12
21. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 12
22. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 12
23. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 6 of 12
24. (board person10 plane1 city2)
   deleted: (at person10 city2)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 6 of 12
25. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 17282 to 21622, (fuel plane1) from 13670 to 9330
   goals met: 6 of 12
26. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 7 of 12
27. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 7 of 12
28. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 21622 to 24247, (fuel plane1) from 9330 to 6705
   goals met: 7 of 12
29. (debark person5 plane1 city5)
   deleted: (in person5 plane1)
   added: (at person5 city5)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 12
30. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 24247 to 28072, (fuel plane1) from 6705 to 2880
   goals met: 9 of 12
31. (refuel plane1 city4)
   changed: (fuel plane1) from 2880 to 13670
   goals met: 9 of 12
32. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 28072 to 31652, (fuel plane1) from 13670 to 10090
   goals met: 8 of 12
33. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 9 of 12
34. (debark person10 plane1 city3)
   deleted: (in person10 plane1)
   added: (at person10 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 12
35. (zoom plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 31652 to 40244, (fuel plane1) from 10090 to 1498
   goals met: 11 of 12
36. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 40244 to 40768, (fuel plane2) from 729 to 205
   goals met: 10 of 12
37. (debark person6 plane2 city0)
   deleted: (in person6 plane2)
   added: (at person6 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 11 of 12
38. (refuel plane2 city0)
   changed: (fuel plane2) from 205 to 2999
   goals met: 11 of 12
39. (zoom plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 40768 to 41816, (fuel plane2) from 2999 to 1951
   goals met: 12 of 12
